src/soap/MantisConnectBinding.mc_issue_note_add.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://futureware.biz/mantisconnect">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:mc_issue_note_add>
   <username></username>
   <password></password>
   <issue_id></issue_id>
   <note>
    <id></id>
    <reporter>
     <id></id>
     <name></name>
     <real_name></real_name>
     <email></email>
    </reporter>
    <text></text>
    <view_state>
     <id></id>
     <name></name>
    </view_state>
    <date_submitted>2013-06-23T00:32:00Z</date_submitted>
    <last_modified>2013-06-23T00:32:00Z</last_modified>
    <time_tracking></time_tracking>
    <note_type></note_type>
    <note_attr></note_attr>
   </note>
  </ns1:mc_issue_note_add>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
